configuration/src/Catalogs/Процессы/Процессы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Процессы</name>
  <comment>Используется для настройки переходов между статусами, как стандартными, так и пользовательскими</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщий</name>
    <comment>Нужен на первое время, что бы если были ошибки, можно было бы вернуться к старой схеме</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>Тип объекта, к которому относится процесс</comment>
    <type>
      <types>CatalogRef.ТипыОбъектовВладельцев</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияПриПереходах</name>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <comment>Уникальный идентификатор перехода</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <comment>Действие, выполняемое при смене статуса</comment>
      <type>
        <types>CatalogRef.ДействияПриСменеСтатуса</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Пользователь, добавивший переход</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>Дата последнего изменения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСменыСтатусов</name>
    <attributes>
      <name>ТекущийСтатус</name>
      <comment>Текущий статус задачи</comment>
      <type>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>СледующийСтатус</name>
      <comment>Статус, в который доступен переход</comment>
      <type>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <comment>Роль пользователя, которой доступно использование перехода</comment>
      <type>
        <types>CatalogRef.РолиУчастников</types>
      </type>
    </attributes>
    <attributes>
      <name>БыстрыйДоступ</name>
      <comment>Определяет, будет ли статус помещен в выпадаюший список</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <comment>Уникальный идентификатор перехода, используется для привязки действий</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Пользователь, добавивший переход</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>Дата последнего изменения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/ПорядокЭтаповКанбана/ПорядокЭтаповКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокЭтаповКанбана</name>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыКанбана</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ТипыКанбана/ТипыКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКанбана</name>
  <enumValues>
    <name>ЗадачаНовый</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРазработку</name>
  </enumValues>
  <enumValues>
    <name>Проекты</name>
  </enumValues>
  <enumValues>
    <name>Кастомный</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееЗаданиеНовый</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиМоегоФилиала</name>
  </enumValues>
  <enumValues>
    <name>ПулЗаявокНовый</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/Филиалы/Филиалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Филиалы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>КастомныеКоманды</name>
      <description>Кастомные команды</description>
    </items>
  </predefined>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФилиала</name>
    <type>
      <types>EnumRef.ТипыФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленВИсточнике</name>
    <comment>Устанавливается в Истину, если обменом пришло Удаление объекта.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбщийКаналRocketChat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИерархияТерриторий</name>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Территории</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрабатываемыеСистемы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ЭтапыКанбана/ЭтапыКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыКанбана</name>
  <owners>Catalog.Филиалы</owners>
  <owners>Catalog.Процессы</owners>
  <attributes>
    <name>ПорядокОтображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКанбана</name>
    <type>
      <types>EnumRef.ТипыКанбана</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМаксимальноеКоличествоЗадач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМинимальноеКоличествоЗадач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Переходы</name>
    <attributes>
      <name>ЭлементПерехода</name>
      <type>
        <types>CatalogRef.ЭтапыКанбана</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьВидыИсполнителей</name>
    <attributes>
      <name>ВидИсполнителя</name>
      <type>
        <types>EnumRef.ПринадлежностьИсполнителейКЗадаче</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыЭтапа</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ВидыЗадач</types>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ТипыОбъектовВладельцев/ТипыОбъектовВладельцев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОбъектовВладельцев</name>
  <comment>Хранит предопределенные элементы, которые соответствуют определенным объектам конфигурации</comment>
  <predefined>
    <items>
      <name>Документ_ВнутреннееЗадание</name>
      <description>Документ &quot;Внутреннее задание&quot;</description>
    </items>
    <items>
      <name>Документ_Задача</name>
      <description>Документ &quot;Задача&quot;</description>
    </items>
    <items>
      <name>Документ_ЗаявкаНаРазработку</name>
      <description>Документ &quot;Заявка на разработку&quot;</description>
    </items>
    <items>
      <name>Справочник_Проекты</name>
      <description>Справочник &quot;Проекты&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/Процессы/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ОписаниеПеременных

// Хранит описание изменений объекта
Перем ОписаниеИзменений;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Филиал, "Руководитель, ЗаместительРуководителя");
	
	Если НЕ (Данные.Руководитель = ПараметрыСеанса.ТекущийПользователь
			ИЛИ Данные.ЗаместительРуководителя = ПараметрыСеанса.ТекущийПользователь
			ИЛИ УправлениеДоступомПовтИсп.ПроверитьДоступностьРоли("Администратор")) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет прав на редактирование процесса.", , , , Отказ);
		Возврат;
	КонецЕсли;
	
	// С пустым филиалом должен быть только один процесс
	Если НЕ ЗначениеЗаполнено(Филиал) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Процессы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Процессы КАК Процессы
		|ГДЕ
		|	Процессы.Ссылка <> &Ссылка
		|	И Процессы.ТипОбъекта = &ТипОбъекта
		|	И Процессы.Филиал = Значение(Справочник.Филиалы.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создать процесс с пустым филиалом", , , , Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеИзменений = ОбщегоНазначения.ПолучитьСостояниеОбъектаДоЗаписи(Ссылка);

	Если ЭтоНовый() Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
		ДатаСоздания = ТекущаяДатаСеанса();
	Иначе
		ДатаИзменения = ТекущаяДатаСеанса();	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыКанбана.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыКанбана КАК ЭтапыКанбана
		|ГДЕ
		|	ЭтапыКанбана.Владелец = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЭтапОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЭтапОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
	ИначеЕсли (ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_Задача 
		ИЛИ ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_ВнутреннееЗадание) 
		И НастройкиСменыСтатусов.Количество() > 0 Тогда
		
		ОбработатьИзменениеЭтаповКанбана(Ссылка, НастройкиСменыСтатусов);
	КонецЕсли;
	
	ОбщегоНазначения.ОбработатьИзменениеОбъекта(Ссылка, ОписаниеИзменений, , , Истина);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	ДатаСоздания = ТекущаяДатаСеанса();
	ДатаИзменения = Дата("00010101");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИзменениеЭтаповКанбана(Ссылка, Знач НастройкиСменыСтатусов)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроцессыНастройкиСменыСтатусов.ТекущийСтатус КАК ТекущийСтатус,
	|	ПроцессыНастройкиСменыСтатусов.СледующийСтатус КАК СледующийСтатус,
	|	ПроцессыНастройкиСменыСтатусов.ИдентификаторПерехода КАК ИдентификаторПерехода
	|ПОМЕСТИТЬ НовыеНастройки
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Процессы.НастройкиСменыСтатусов КАК ПроцессыНастройкиСменыСтатусов
	|		ПО (ПроцессыНастройкиСменыСтатусов.Ссылка = Процессы.Ссылка)
	|ГДЕ
	|	Процессы.Ссылка = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыКанбана.Ссылка КАК Ссылка,
	|	ЭтапыКанбанаЭлементыЭтапа.Элемент КАК Статус,
	|	ЭтапыКанбана.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ СуществующиеЭтапы
	|ИЗ
	|	Справочник.ЭтапыКанбана КАК ЭтапыКанбана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.ЭлементыЭтапа КАК ЭтапыКанбанаЭлементыЭтапа
	|		ПО (ЭтапыКанбанаЭлементыЭтапа.Ссылка = ЭтапыКанбана.Ссылка)
	|ГДЕ
	|	ЭтапыКанбана.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеНастройки.ТекущийСтатус КАК Статус,
	|	СтатусыОбъектов.Наименование КАК Наименование,
	|	СтатусыОбъектов.Порядок КАК ПорядокОтображения,
	|	ЕСТЬNULL(СуществующиеЭтапы.Ссылка, НЕОПРЕДЕЛЕНО) КАК Этап
	|ИЗ
	|	НовыеНастройки КАК НовыеНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО НовыеНастройки.ТекущийСтатус = СтатусыОбъектов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеЭтапы КАК СуществующиеЭтапы
	|		ПО НовыеНастройки.ТекущийСтатус = СуществующиеЭтапы.Статус
	|ГДЕ
	|	ЕСТЬNULL(СуществующиеЭтапы.ПометкаУдаления, ИСТИНА)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НовыеНастройки.СледующийСтатус,
	|	СтатусыОбъектов.Наименование,
	|	СтатусыОбъектов.Порядок,
	|	ЕСТЬNULL(СуществующиеЭтапы.Ссылка, НЕОПРЕДЕЛЕНО)
	|ИЗ
	|	НовыеНастройки КАК НовыеНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО НовыеНастройки.СледующийСтатус = СтатусыОбъектов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеЭтапы КАК СуществующиеЭтапы
	|		ПО НовыеНастройки.СледующийСтатус = СуществующиеЭтапы.Статус
	|ГДЕ
	|	ЕСТЬNULL(СуществующиеЭтапы.ПометкаУдаления, ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокОтображения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыКанбана.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭтапыКанбана КАК ЭтапыКанбана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.ЭлементыЭтапа КАК ЭтапыКанбанаЭлементыЭтапа
	|		ПО ЭтапыКанбана.Ссылка = ЭтапыКанбанаЭлементыЭтапа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеНастройки КАК ПереходИзСтатуса
	|		ПО (ЭтапыКанбанаЭлементыЭтапа.Элемент = ПереходИзСтатуса.ТекущийСтатус)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеНастройки КАК ПереходВСтатус
	|		ПО (ЭтапыКанбанаЭлементыЭтапа.Элемент = ПереходВСтатус.СледующийСтатус)
	|ГДЕ
	|	ЭтапыКанбана.Владелец = &Владелец
	|	И НЕ ЭтапыКанбана.ПометкаУдаления
	|	И ПереходИзСтатуса.ТекущийСтатус ЕСТЬ NULL
	|	И ПереходВСтатус.СледующийСтатус ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Владелец", Ссылка);

	Если ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_Задача Тогда
		ТипКанбана = Перечисления.ТипыКанбана.ЗадачаНовый;
	ИначеЕсли ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_ВнутреннееЗадание Тогда
		ТипКанбана = Перечисления.ТипыКанбана.ВнутреннееЗаданиеНовый;
	Иначе
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДобавляемыеЭтапы = РезультатЗапроса[2].Выбрать();
	МассивДобавленных = Новый Массив;
	
	Пока ДобавляемыеЭтапы.Следующий() Цикл
		Если ДобавляемыеЭтапы.Этап = Неопределено Тогда
			НовыйЭтап = Справочники.ЭтапыКанбана.СоздатьЭлемент();

			ЗаполнитьЗначенияСвойств(НовыйЭтап, ДобавляемыеЭтапы);
			НовыйЭтап.ТипКанбана = ТипКанбана;
			НовыйЭтап.Владелец = Ссылка;
			Элемент = НовыйЭтап.ЭлементыЭтапа.Добавить();
			Элемент.Элемент = ДобавляемыеЭтапы.Статус;
		Иначе
			НовыйЭтап = ДобавляемыеЭтапы.Этап.ПолучитьОбъект();
			НовыйЭтап.ПометкаУдаления = Ложь;
		КонецЕсли;
		
		НовыйЭтап.Записать();
		МассивДобавленных.Добавить(НовыйЭтап.Ссылка);
	КонецЦикла;
	
	Если МассивДобавленных.Количество() > 0 Тогда
		РегистрыСведений.ПорядокЭтаповКанбана.ДобавитьЭтапы(МассивДобавленных, ТипКанбана, Ссылка);
	КонецЕсли;
	
	УдаляемыеЭтапы = РезультатЗапроса[3].Выбрать();
	МассивУдаленных = Новый Массив;
	
	Пока УдаляемыеЭтапы.Следующий() Цикл
		ЭтапОбъект = УдаляемыеЭтапы.Ссылка.ПолучитьОбъект();
		ЭтапОбъект.Переходы.Очистить();
		ЭтапОбъект.ПометкаУдаления = Истина;
		
		ЭтапОбъект.Записать();
		МассивУдаленных.Добавить(УдаляемыеЭтапы.Ссылка);
	КонецЦикла;	
	
	Если МассивУдаленных.Количество() > 0 Тогда
		РегистрыСведений.ПорядокЭтаповКанбана.УдалитьЭтапы(МассивУдаленных, ТипКанбана, Ссылка);
	КонецЕсли;
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроцессыНастройкиСменыСтатусов.ТекущийСтатус КАК ТекущийСтатус,
	|	ПроцессыНастройкиСменыСтатусов.СледующийСтатус КАК СледующийСтатус,
	|	ПроцессыНастройкиСменыСтатусов.ИдентификаторПерехода КАК ИдентификаторПерехода
	|ПОМЕСТИТЬ НовыеНастройки
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Процессы.НастройкиСменыСтатусов КАК ПроцессыНастройкиСменыСтатусов
	|		ПО (ПроцессыНастройкиСменыСтатусов.Ссылка = Процессы.Ссылка)
	|ГДЕ
	|	Процессы.Ссылка = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	ЭтапыКанбана.Ссылка КАК Этап,
	|	ЭтапыКанбанаСтатус.Элемент КАК СтатусЭтапа,
	|	СправочникЭтапыКанбанаПереходы.ЭлементПерехода КАК ЭлементПерехода,
	|	ЭтапыКанбанаЭлементыЭтапа.Элемент КАК СтатусПерехода
	|ПОМЕСТИТЬ СуществующиеПереходы
	|ИЗ
	|	Справочник.ЭтапыКанбана КАК ЭтапыКанбана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.ЭлементыЭтапа КАК ЭтапыКанбанаСтатус
	|		ПО (ЭтапыКанбанаСтатус.Ссылка = ЭтапыКанбана.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.Переходы КАК СправочникЭтапыКанбанаПереходы
	|		ПО (СправочникЭтапыКанбанаПереходы.Ссылка = ЭтапыКанбана.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.ЭлементыЭтапа КАК ЭтапыКанбанаЭлементыЭтапа
	|		ПО (СправочникЭтапыКанбанаПереходы.ЭлементПерехода = ЭтапыКанбанаЭлементыЭтапа.Ссылка)
	|ГДЕ
	|	ЭтапыКанбана.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыКанбана.Ссылка КАК Ссылка,
	|	НовыеНастройки.СледующийСтатус КАК СледующийСтатус
	|ПОМЕСТИТЬ ЭтапСтатусПерехода
	|ИЗ
	|	Справочник.ЭтапыКанбана КАК ЭтапыКанбана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.ЭлементыЭтапа КАК ЭтапыКанбанаЭлементыЭтапа
	|		ПО ЭтапыКанбана.Ссылка = ЭтапыКанбанаЭлементыЭтапа.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НовыеНастройки КАК НовыеНастройки
	|		ПО (ЭтапыКанбанаЭлементыЭтапа.Элемент = НовыеНастройки.ТекущийСтатус)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеПереходы КАК СуществующиеПереходы
	|		ПО (ЭтапыКанбанаЭлементыЭтапа.Ссылка = СуществующиеПереходы.Этап)
	|			И (СуществующиеПереходы.СтатусПерехода = НовыеНастройки.СледующийСтатус)
	|ГДЕ
	|	ЭтапыКанбана.Владелец = &Владелец
	|	И СуществующиеПереходы.СтатусПерехода ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапСтатусПерехода.Ссылка КАК Этап,
	|	ЭтапыКанбанаЭлементыЭтапа.Ссылка КАК Переход
	|ИЗ
	|	ЭтапСтатусПерехода КАК ЭтапСтатусПерехода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.ЭлементыЭтапа КАК ЭтапыКанбанаЭлементыЭтапа
	|		ПО ЭтапСтатусПерехода.СледующийСтатус = ЭтапыКанбанаЭлементыЭтапа.Элемент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана КАК ЭтапыКанбана
	|		ПО (ЭтапыКанбанаЭлементыЭтапа.Ссылка = ЭтапыКанбана.Ссылка)
	|			И (ЭтапыКанбана.Владелец = &Владелец)
	|ИТОГИ ПО
	|	Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыКанбана.Ссылка КАК Этап,
	|	СуществующиеПереходы.ЭлементПерехода КАК Переход
	|ИЗ
	|	Справочник.ЭтапыКанбана КАК ЭтапыКанбана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыКанбана.ЭлементыЭтапа КАК ЭтапыКанбанаЭлементыЭтапа
	|		ПО ЭтапыКанбана.Ссылка = ЭтапыКанбанаЭлементыЭтапа.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуществующиеПереходы КАК СуществующиеПереходы
	|		ПО (ЭтапыКанбанаЭлементыЭтапа.Ссылка = СуществующиеПереходы.Этап)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеНастройки КАК НовыеНастройки
	|		ПО (СуществующиеПереходы.СтатусЭтапа = НовыеНастройки.ТекущийСтатус)
	|			И (СуществующиеПереходы.СтатусПерехода = НовыеНастройки.СледующийСтатус)
	|ГДЕ
	|	ЭтапыКанбана.Владелец = &Владелец
	|	И НовыеНастройки.ИдентификаторПерехода ЕСТЬ NULL
	|ИТОГИ ПО
	|	Этап";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВГраница = РезультатЗапроса.ВГраница();
	
	ВыборкаДобавить = РезультатЗапроса[ВГраница - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДобавить.Следующий() Цикл
		ЭтапОбъект = ВыборкаДобавить.Этап.ПолучитьОбъект();
		ЭтапОбъект.ПометкаУдаления = Ложь;
		
		ДобавляемыеПереходы = ВыборкаДобавить.Выбрать();
		Пока ДобавляемыеПереходы.Следующий() Цикл
			НовыйПереход = ЭтапОбъект.Переходы.Добавить();
			НовыйПереход.ЭлементПерехода = ДобавляемыеПереходы.Переход;
		КонецЦикла;
		
		ЭтапОбъект.Записать();
	КонецЦикла;
	
	ВыборкаУдалить = РезультатЗапроса[ВГраница].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУдалить.Следующий() Цикл
		ЭтапОбъект = ВыборкаУдалить.Этап.ПолучитьОбъект();
		
		УдаляемыеПереходы = ВыборкаУдалить.Выбрать();
		Пока УдаляемыеПереходы.Следующий() Цикл
			ЭтапОбъект.Переходы.Удалить(ЭтапОбъект.Переходы.Найти(УдаляемыеПереходы.Переход));
		КонецЦикла;
		
		ЭтапОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
